{
  "translation": {
    "navbar":{
      "home": "Home",
      "skills": "Skills",
      "projects": "Projects",
      "reviews": "Reviews",
      "contact": "Let's get in touch !"
    },
    "one": {
      "text-1": "Hi, I'm Maël",
      "text-2": "Full Stack developper",
      "text-3": "My name is Maël Mainsard, I am 20 years old and I am currently working at BPCE - IT (Nantes) in an IT development position (Back-End). As a development enthusiast, I hope you enjoy reading this portfolio.",
      "text-4": "Click here to get my CV"
    },
    "two": {
      "text-1": "Skills",
      "text-2": "Here is an overview of the skills I have acquired since the start of my career",
      "text-3": "Mobile development",
      "text-4": "Software development",
      "text-5": "Web development",
      "text-6": "IOT development",
      "text-7": "Project management",
      "text-8": "Open technology list",
      "text-9": "Database"
    },
    "three":{
      "text-1": "Discover me",
      "text-2": "Click on one of the menu tabs below to find out more about me",
      "text-3": "My projects",
      "text-4": "Professional experiences",
      "text-5": "My certifications",
      "text-6": "International",
      "text-7": "Intrigued ?",
      "text-8": "Learn more",
      "text-9": "Project type",
      "text-10": "Mobile application",
      "text-11": "Rest API",
      "text-12": "Frontend type",
      "text-13": "Backend type",
      "text-14": "Close",
      "text-15": "Project info",
      "text-16": "Software",
      "text-17": "Robotics",
      "text-18": "Technologies used",
      "projects": {
        "planmysearch": {
          "title": "My Search Plan | Application tracking",
          "description": "The application I developed in Flutter with Firebase as a database is a tool designed to simplify the job search process. By combining the flexibility of Flutter with the power of Firebase, I created an intuitive and efficient platform that allows job seekers to strategically plan and organize their applications."
        },
        "kiomdawifi": {
          "title": "Kiomda Wifi | Data record",
          "description": "During my undergraduate degree, I worked for a company specializing in the manufacturing of counting boxes. Normally, the data collected by these boxes is sent via an IoT network. To remedy the problems connectivity, I created a mobile application in Flutter. This application allows you to retrieve data via a local WiFi connection in case of no network. Then, when the connection is reestablished, the data is automatically sent to a database Firebase data. This solution helped maintain data collection in environments where the network was unstable and helped attract new customers to our business."
        },
        "kiomdaapi": {
          "title": "Kiomda API",
          "description": "In my experience within the same company, I had the opportunity to develop a REST API compliant with OpenAPI standards, accompanied by a dedicated site to facilitate the manipulation of this API. The API itself -itself is implemented in Node.js, providing a robust and flexible framework for managing requests and responses. The backend is hosted on Firebase, providing a reliable and scalable infrastructure for storing and managing data. As for the frontend, it has was developed in React, providing a responsive and intuitive user interface for interacting with the API. This comprehensive and consistent architecture helped create an efficient and user-friendly solution, while reinforcing our company's reputation for innovative technology and quality of service."
        },
        "deltadore": {
          "title": "Management software",
          "description": "During a previous professional experience, I developed software in C# which had the function of scanning the barcodes of electronic cards, thus making it possible to recover essential information for the production process This software offered a user-friendly interface that allowed users to quickly and efficiently scan electronic card barcodes, making it easier to collect critical information such as serial numbers, manufacturing dates, and other relevant data. With this solution, the company was able to streamline and accelerate the production process, thereby improving operational efficiency and the quality of delivered products."
        },
        "bobby": {
          "title": "Boby the robot",
          "description": "During my DUT, I designed a robot controlled by a Raspberry Pi card. It could be controlled remotely via Bluetooth using a mobile application and performed facial recognition using the camera and OpenCV. The application allowed intuitive control of the robot, while facial recognition allowed it to react to the presence of faces. For more details, you can consult the report at https://compte-rendu-bobby-er4 .webnode.fr. This project strengthened my skills in programming, electronics and image processing, while developing innovative solutions."
        }
      }
    }
  }
}