{
    "translation": {
      "navbar":{
        "home": "Accueil",
        "skills": "Compétences",
        "projects": "Projets",
        "reviews": "Avis",
        "contact": "Contactez-moi"
      },
      "one": {
        "text-1": "Salut, je suis Maël",
        "text-2": "Développeur Full Stack",
        "text-3": "Je m'appelle Maël Mainsard, j'ai 20 ans et je suis actuellement alternant à BPCE - IT (Nantes) sur un poste de développement informatique (Back-End). En tant que passionné de développement, je vous souhaite une bonne lecture de ce portofolio.",
        "text-4": "Cliquez ici pour obtenir mon CV"
      },
      "two": {
        "text-1": "Compétences",
        "text-2": "Voici un aperçu des compétences que j'ai pu acquérir depuis le début de ma carrière",
        "text-3": "Développement mobile",
        "text-4": "Développement logiciel",
        "text-5": "Développement web",
        "text-6": "Développement IOT",
        "text-7": "Gestion de projets",
        "text-8": "Liste des techno",
        "text-9": "Bases de données"
      },
      "three":{
        "text-1": "Découvrez-moi",
        "text-2": "Cliquez sur un des onglets du menu ci-dessous pour en savoir plus sur moi",
        "text-3": "Mes projets",
        "text-4": "Expériences professionnelles",
        "text-5": "Mes certifications",
        "text-6": "L'international",
        "text-7": "Intrigué ?",
        "text-8": "En savoir plus",
        "text-9": "Type de projet",
        "text-10": "Application mobile",
        "text-11": "API Rest",
        "text-12": "Type de frontend",
        "text-13": "Type de backend",
        "text-14": "Fermer",
        "text-15": "Info du projet",
        "text-16": "Logiciel",
        "text-17": "Robotique",
        "text-18": "Technologies utilisées",

        "works": [
          {
            "title": "Développeur Back-End chez BPCE - IT (Nantes)",
            "date": "Sept 2023 - MTN",
            "description": "Développement d'un outil de récupération des paramêtres de plusieurs parc de serveur. Puis réstitution des données sur powerBi"
          },
          {
            "title": "Développeur R&D chez KIOMDA (Lannion)",
            "date": "Sept 2022 - Août 2023",
            "description" : "Maintenance de logiciel en C++, réalisation de POC et d'une application mobile hybride avec Flutter."
          },
          {
            "title": "Agent de mise en rayons",
            "date": "1 an - 2022-2023",
            "description" : "J'ai travaillé tous les samedis pendant 1 an à l'intermarché de Combourg pour étoffer mon répertoire de compétences. Et payer mes voyages."
          },
          {
            "title": "Stage développement logiciel",
            "date" : "6 mois - 2022",
            "description": "Lors de mon stage de DUT, réalisation d'un logiciel en C# pour l'équipe de production de l'entreprise Delta Dore (Bonnemain). Base de données exel et développement sur visual studio."
          },
          {
            "title" : "Serveur en restauration",
            "date" : "2 mois - 2021",
            "description" : "Lors de l'été 2021, j'ai travaillé en temps que serveur dans le restaurant La cour du temple à Combourg. J'ai pu y développer mon dynamisme ainsi que ma convivialité."
          }
        ],

        "projects": {
          "planmysearch": {
            "title" : "Plan My Search | Suivit de candidature",
            "description" : "L'application que j'ai développé en Flutter avec Firebase comme base de données est un outil conçu pour simplifier le processus de recherche d'emploi. En combinant la flexibilité de Flutter avec la puissance de Firebase, j'ai créé une plateforme intuitive et efficace qui permet aux chercheurs d'emploi de planifier et d'organiser leurs candidatures de manière stratégique."
          },
          "kiomdawifi": {
            "title" : "Kiomda Wifi | Relevé de données",
            "description" : "A l'ocasion de mon alternance de Licence, j'ai travaillé pour une entreprise spécialisée dans la fabrication de boîtiers de comptage. Normalement, les données collectées par ces boîtiers sont envoyées via un réseau IoT. Pour remédier aux problèmes de connectivité, j'ai créé une application mobile en Flutter. Cette application permet de récupérer les données via une connexion WiFi locale en cas d'absence de réseau. Ensuite, lorsque la connexion est rétablie, les données sont automatiquement envoyées à une base de données Firebase. Cette solution a permis de maintenir la collecte des données dans des environnements où le réseau est instable et a contribué à attirer de nouveaux clients pour notre entreprise."
          },
          "kiomdaapi": {
            "title": "Kiomda API",
            "description": "Dans mon expérience au sein de la même entreprise, j'ai eu l'opportunité de développer une API REST conforme aux normes OpenAPI, accompagnée d'un site dédié pour faciliter la manipulation de cette API. L'API elle-même est implémentée en Node.js, offrant une structure robuste et flexible pour gérer les requêtes et les réponses. Le backend est hébergé sur Firebase, offrant ainsi une infrastructure fiable et évolutive pour stocker et gérer les données. Quant au frontend, il a été développé en React, offrant une interface utilisateur réactive et intuitive pour interagir avec l'API. Cette architecture complète et cohérente a permis de créer une solution efficace et conviviale pour les utilisateurs, tout en renforçant la réputation de notre entreprise en matière de technologie innovante et de qualité de service."
          },
          "deltadore":{
            "title" : "Logicel de gestion",
            "description" : "Au cours d'une expérience professionnelle précédente, j'ai développé un logiciel en C# qui avait pour fonction de scanner les codes-barres des cartes électroniques, permettant ainsi de récupérer des informations essentielles pour le processus de mise en production. Ce logiciel offrait une interface conviviale permettant aux utilisateurs de scanner rapidement et efficacement les codes-barres des cartes électroniques, facilitant ainsi la collecte d'informations critiques telles que les numéros de série, les dates de fabrication et d'autres données pertinentes. Grâce à cette solution, l'entreprise a pu rationaliser et accélérer le processus de production, améliorant ainsi l'efficacité opérationnelle et la qualité des produits livrés."
          },
          "bobby":{
            "title": "Boby le robot",
            "description": "Pendant mon DUT, j'ai conçu un robot contrôlé par une carte Raspberry Pi. Il pouvait être piloté à distance via Bluetooth grâce à une application mobile et effectuait la reconnaissance faciale à l'aide de la caméra et d'OpenCV. L'application permettait un contrôle intuitif du robot, tandis que la reconnaissance faciale lui permettait de réagir à la présence de visages. Pour plus de détails, vous pouvez consulter le compte rendu sur https://compte-rendu-bobby-er4.webnode.fr . Ce projet a renforcé mes compétences en programmation, électronique et traitement d'image, tout en développant des solutions innovantes."
          }

        },

        "certifications": [
          {
            "title": "Baccalauréat STI2D (Science et technologie du développement durable)",
            "date": "01/07/2020",
            "image": "/certifications/bac.jpg"
          },
          {
            "title": "DUT GEII (Génie électrique et informatique",
            "date": "30/06/2022",
            "image": "/certifications/dut.jpg"
          },
          {
            "title": "Certification Flutter Udemy",
            "date" : "06/01/2023",
            "image": "/certifications/flutter-1.jpg"
          },
          {
            "title" : "Licence professionnelle CHIC (Chaîne instrumentale connectée)",
            "date" : "18/07/2023",
            "image": "/certifications/licence.jpg"
          }
        ]
    }
  }
}